soapservice/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://test.io/">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:saveEmployeeRequest>
            <gs:employee>
                <gs:name>nombre2</gs:name>
                <gs:surname>apellido</gs:surname>
                <gs:documentType>1</gs:documentType>
                <gs:documentNumber>123456789</gs:documentNumber>
                <gs:birthDay>1998-04-12</gs:birthDay>
                <gs:hireDay>2020-04-12</gs:hireDay>
                <gs:role>admin</gs:role>
                <gs:salary>12345</gs:salary>
                <gs:age></gs:age>
                <gs:hireTime></gs:hireTime>
            </gs:employee>
        </gs:saveEmployeeRequest>
    </soapenv:Body>
</soapenv:Envelope>
